<img align="left" src="https://ithaka-labs.s3.amazonaws.com/static-files/images/tdm/tdmdocs/CC_BY.png"><br />

This notebook is adapted by Zhuo Chen from the notebooks created by [Nathan Kelber](https://github.com/ithaka/tdm-notebooks/blob/e6275296c010280909e90e3ea47922d52d99c5a7/pandas-1.ipynb), [William Mattingly](https://github.com/wjbmattingly/tap-2022-pandas) and [Melanie Walsh](https://github.com/melaniewalsh/Data-Analysis-with-Pandas) under [Creative Commons CC BY License](https://creativecommons.org/licenses/by/4.0/).<br />
For questions/comments/improvements, email zhuo.chen@ithaka.org or nathan.kelber@ithaka.org.<br />
___

# Pandas 1

**Description:** This notebook describes how to:
* Create a Pandas Series or a DataFrame
* Explore the data in a dataframe
* Access data from a dataframe
* Add new data to a dataframe
* Create a dataframe from files of different format

This is the first notebook in a series on learning to use Pandas. 

**Use Case:** For Learners (Detailed explanation, not ideal for researchers)

**Difficulty:** Intermediate

**Knowledge Required:** 
* Python Basics ([Start Python Basics I](./python-basics-1.ipynb))

**Knowledge Recommended:** 
* [Python Intermediate 2](./python-intermediate-2.ipynb)
* [Python Intermediate 4](./python-intermediate-4.ipynb)

**Completion Time:** 90 minutes

**Data Format:** .csv, .xsxl

**Libraries Used:** Pandas

**Research Pipeline:** None
___

## Introduction

<center><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png" width="500"></center>

Pandas is a Python library that allows you to easily work with tabular data. Most people are familiar with commercial spreadsheet software, such as Microsoft Excel or Google Sheets. While spreadsheet software and Pandas can accomplish similar tasks, each has significant advantages depending on the use-case.

**Advantages of Spreadsheet Software**
* Point and click
* Easier to learn
* Great for small datasets (<10,000 rows)
* Better for browsing data

**Advantages of Pandas**
* More powerful data manipulation with Python
* Can work with large datasets (millions of rows)
* Faster for complicated manipulations
* Better for cleaning and/or pre-processing data
* Can automate workflows in a larger data pipeline

In short, spreadsheet software is better for browsing small datasets and making moderate adjustments. Pandas is better for automating data cleaning processes that require large or complex data manipulation.

In [1]:
# import pandas, `as pd` allows us to shorten typing `pandas` to `pd` when we call pandas
import pandas as pd

## Pandas Series and Pandas DataFrame
In Pandas, data are stored in two fundamental objects: 

* **Pandas Series** - a single column or row of data
* **Pandas DataFrame** - a table of data containing multiple columns and rows

### Pandas Series

We can think of a Series as a single column or row of data. Here we have a column called `Champions` with the country names of the winners of the most recent ten FIFA world cup games.

|Champions|
|---|
|Argentina|
|France|
|Germany|
|Spain|
|Italy|
|Brazil|
|France|
|Brazil|
|Germany|
|Argentina|

Let's create a Series based on this column. To create our Series, we pass a **list** into the `.Series()` method:

In [2]:
# Create a data series object in Pandas
champions = pd.Series(["Argentina",
                       "France", 
                       "Germany", 
                       "Spain", 
                       "Italy", 
                       "Brazil", 
                       "France", 
                       "Brazil", 
                       "Germany",
                       "Argentina"]
                    )

In [3]:
# Print out the Series
print(champions)

0    Argentina
1       France
2      Germany
3        Spain
4        Italy
5       Brazil
6       France
7       Brazil
8      Germany
9    Argentina
dtype: object

As you can see, except the data column, we also have an index column. By default, the indexes are numerical. You can also specify the indexes by passing a **dictionary** when making a Pandas Series. The keys of the dictionary will be used as the indexes.

In [4]:
# Create a pandas series by passing in a dictionary
pd.Series({2022: 'Argentina',
          2018: 'France',
          2014: 'Germany',
          2010: 'Spain',
          2006: 'Italy',
          2002: 'Brazil',
          1998: 'France',
          1994: 'Brazil',
          1990: 'Germany',
          1986: 'Argentina'})

2022    Argentina
2018       France
2014      Germany
2010        Spain
2006        Italy
2002       Brazil
1998       France
1994       Brazil
1990      Germany
1986    Argentina
dtype: object

Or, you can use the `index` parameter in the `.Series()` method to set the indexes.

In [5]:
 pd.Series(["Argentina", 
            "France", 
            "Germany", 
            "Spain", 
            "Italy", 
            "Brazil", 
            "France", 
            "Brazil", 
            "Germany",
            "Argentina"],
            index=[2022,
                  2018,
                  2014,
                  2010,
                  2006,
                  2002,
                  1998,
                  1994,
                  1990,
                  1986])

2022    Argentina
2018       France
2014      Germany
2010        Spain
2006        Italy
2002       Brazil
1998       France
1994       Brazil
1990      Germany
1986    Argentina
dtype: object

You can give a name to your Pandas Series using the `name` parameter.

In [6]:
pd.Series(["Argentina", 
            "France", 
            "Germany", 
            "Spain", 
            "Italy", 
            "Brazil", 
            "France", 
            "Brazil", 
            "Germany",
            "Argentina"],
            index=[2022,
                  2018,
                  2014,
                  2010,
                  2006,
                  2002,
                  1998,
                  1994,
                  1990,
                  1986],
            name='World Cup Champions')

2022    Argentina
2018       France
2014      Germany
2010        Spain
2006        Italy
2002       Brazil
1998       France
1994       Brazil
1990      Germany
1986    Argentina
Name: World Cup Champions, dtype: object

### Pandas DataFrame

While a Pandas Series is a single column of data, a Pandas DataFrame can have multiple columns and rows. 

|Year|Champion|Host|
|---|---|---|
|2022|Argentina|Qatar|
|2018|France|Russia|
|2014|Germany|Brazil|
|2010|Spain|South Africa|
|2006|Italy|Germany|
|2002|Brazil|Korea/Japan|
|1998|France|France|
|1994|Brazil|USA|
|1990|Germany|Italy|
|1986|Argentina|Mexico|

Let's create a Pandas DataFrame based on this table. To create our dataframe, we pass a **dictionary** into the `DataFrame()` method. Each `key:value` pair will form a column in the dataframe, with the key as the column name and the value as the data in that column.

In [7]:
# Create a Pandas dataframe
wcup = pd.DataFrame({"Year": [2022, 
                              2018, 
                              2014, 
                              2010, 
                              2006, 
                              2002, 
                              1998, 
                              1994, 
                              1990,
                              1986], 
                     "Champion": ["Argentina", 
                                  "France", 
                                  "Germany", 
                                  "Spain", 
                                  "Italy", 
                                  "Brazil", 
                                  "France", 
                                  "Brazil", 
                                  "Germany", 
                                  "Argentina"], 
                     "Host": ["Qatar", 
                              "Russia", 
                              "Brazil", 
                              "South Africa", 
                              "Germany", 
                              "Korea/Japan", 
                              "France", 
                              "USA", 
                              "Italy", 
                              "Mexico"]
                    })

wcup

   Year   Champion          Host
0  2022  Argentina         Qatar
1  2018     France        Russia
2  2014    Germany        Brazil
3  2010      Spain  South Africa
4  2006      Italy       Germany
5  2002     Brazil   Korea/Japan
6  1998     France        France
7  1994     Brazil           USA
8  1990    Germany         Italy
9  1986  Argentina        Mexico

In a Pandas dataframe, each row/column is technically a Pandas Series. We can see this by selecting the first row with the `iloc` method and check its type.

In [8]:
# Get the type of a row in a dataframe
type(wcup.iloc[0])

pandas.core.series.Series

Let's also select a column and check its type.

In [9]:
# Get the type of a column in a dataframe
type(wcup['Champion'])

pandas.core.series.Series

We will describe row/column selection in greater detail below.

<h3 style="color:red; display:inline">Coding Challenge! &lt; / &gt; </h3>

You are a middle school teacher. You teach the Butterfly Class and the Hippo Class. Last week, the Butterfly class had an English test and a math test. You would like to make a dataframe to record the English grades and math grades of the students in the Butterfly Class. 

Make a dataframe with three columns: name, English and Math. Please create full names for the students. We will manipulate the name column using a Pandas method in the subsequent exercises.

## Explore the data

After we build a dataframe, it is helpful to get a general idea of the data. The first step is to explore the dataframe's attributes. Attributes are properties of the dataframe (not functions), so they do not have parentheses `()` after them. 

|Attribute|Reveals|
|---|---|
|.shape| The number of rows and columns|
|.columns| The name of each column|


To get how many rows and columns a dataframe has, we use the `.shape` attribute. `df.shape` returns a tuple with (number of rows, number of columns).

In [10]:
# df.shape returns a tuple (# of rows, # of columns)
wcup.shape

(10, 3)

In [11]:
# Get how many rows a dataframe has
wcup.shape[0]

10

In [12]:
# Get how many columns a dataframe has
wcup.shape[1]

3

In [13]:
# Use `.columns` attribute to find the column names
wcup.columns

Index(['Year', 'Champion', 'Host'], dtype='object')

There are some methods we can use to explore the data as well. 


|Method|Reveals|
|---|---|
|.info( )| Column count and data type|
|.head( )| First five rows|
|.tail( )|Last five rows|

In [14]:
# Use `.info()` to get column count and data type
wcup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      10 non-null     int64
 1   Champion  10 non-null     object
 2   Host      10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

We can get a preview of the dataframe. The `.head()` and `.tail()` methods help us do that.

In [15]:
# Display the first five rows of the data
wcup.head()

   Year   Champion          Host
0  2022  Argentina         Qatar
1  2018     France        Russia
2  2014    Germany        Brazil
3  2010      Spain  South Africa
4  2006      Italy       Germany

In [16]:
# Display the last five rows of the data
wcup.tail()

   Year   Champion         Host
5  2002     Brazil  Korea/Japan
6  1998     France       France
7  1994     Brazil          USA
8  1990    Germany        Italy
9  1986  Argentina       Mexico

In [17]:
# Specify the number of rows to display
wcup.head(8)

   Year   Champion          Host
0  2022  Argentina         Qatar
1  2018     France        Russia
2  2014    Germany        Brazil
3  2010      Spain  South Africa
4  2006      Italy       Germany
5  2002     Brazil   Korea/Japan
6  1998     France        France
7  1994     Brazil           USA

## Access data
In this section, we will take a look at the different ways of accessing the data in a dataframe. 

For example, once you get the column names, you could access a column of your interest. You can use the bracket notation `df[ColumnName]` get a specific column.

In [18]:
# Use bracket notation to access the column 'Champion'
wcup['Champion']

0    Argentina
1       France
2      Germany
3        Spain
4        Italy
5       Brazil
6       France
7       Brazil
8      Germany
9    Argentina
Name: Champion, dtype: object

You can see that what gets returned is a Pandas series. If you would like for the returned object to be in the format of a dataframe, you could put the column name within a pair of hard brackets. Note that in this case, you
end up with two layers of hard brackets.

In [19]:
# Add one more layer of square brackets to get a column returned as a dataframe
wcup[['Champion']]

    Champion
0  Argentina
1     France
2    Germany
3      Spain
4      Italy
5     Brazil
6     France
7     Brazil
8    Germany
9  Argentina

We can also access multiple columns from a dataframe by putting the column names in a list. Note that in this case, you have two layers of hard brackets.

In [20]:
# Access multiple columns
wcup[['Year','Champion']]

   Year   Champion
0  2022  Argentina
1  2018     France
2  2014    Germany
3  2010      Spain
4  2006      Italy
5  2002     Brazil
6  1998     France
7  1994     Brazil
8  1990    Germany
9  1986  Argentina

### The indexers `.iloc` and `.loc`
In Pandas, there are two indexers `.iloc` and `.loc` that are often used to access data in a dataframe. 
#### .iloc
`.iloc` allows us to access a row or a column using its *integer location*.

In a dataframe, to the left of each row are index numbers. The index numbers are similar to the index numbers for a Python list; they help us reference a particular row for data retrieval. Also, like a Python list, the index begins with 0. 

We can retrieve data using the `.iloc` attribute. The syntax of `.iloc` indexer is `df.iloc[row selection, column selection]`.

In [21]:
# Access a single row
wcup.iloc[5] # Access the row with the index number 5

Year               2002
Champion         Brazil
Host        Korea/Japan
Name: 5, dtype: object

Again, the returned object is a Pandas series. If you want a dataframe instead, you could put the index number within a pair of hard brackets to do that. You will end up with two layers of hard brackets.

In [22]:
# Access a single row, return a dataframe
wcup.iloc[[5]] # Access the row with the index number 5

   Year Champion         Host
5  2002   Brazil  Korea/Japan

When we select multiple consecutive rows from a dataframe, we give a starting index and an ending index. Notice that the selected rows will **not** include the final index row.

In [23]:
# Access multiple consecutive rows
wcup.iloc[2:5] # Access the rows with the index number 2, 3, and 4

   Year Champion          Host
2  2014  Germany        Brazil
3  2010    Spain  South Africa
4  2006    Italy       Germany

In [24]:
# Access multiple non-consecutive rows
wcup.iloc[[0,2,5]] # Access the rows with the index number 0, 2, and 5

   Year   Champion         Host
0  2022  Argentina        Qatar
2  2014    Germany       Brazil
5  2002     Brazil  Korea/Japan

We can also use the `.iloc` indexer to access columns.

In [25]:
# Access a single column
wcup.iloc[:,1] # Access the second column of the dataframe wcup

0    Argentina
1       France
2      Germany
3        Spain
4        Italy
5       Brazil
6       France
7       Brazil
8      Germany
9    Argentina
Name: Champion, dtype: object

Note that we cannot use the column name to access a column because `.iloc` accesses data using their *integer location*.

In [26]:
# .iloc cannot access a column by its name
wcup.iloc[:,'Champion']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [28]:
# Access multiple consecutive columns 
wcup.iloc[:,1:3] # Access the second and third column of the dataframe wcup

    Champion          Host
0  Argentina         Qatar
1     France        Russia
2    Germany        Brazil
3      Spain  South Africa
4      Italy       Germany
5     Brazil   Korea/Japan
6     France        France
7     Brazil           USA
8    Germany         Italy
9  Argentina        Mexico

In [29]:
# Access multiple non-consecutive columns
wcup.iloc[:,[0,2]] # Access the first and third column of the dataframe wcup

   Year          Host
0  2022         Qatar
1  2018        Russia
2  2014        Brazil
3  2010  South Africa
4  2006       Germany
5  2002   Korea/Japan
6  1998        France
7  1994           USA
8  1990         Italy
9  1986        Mexico

Now that you know how to select rows and columns from a dataframe using `.iloc`. You should be able to figure out how to get a slice of a dataframe using `.iloc`. For example, if you would like to know the champion of the world cup games between 1994 and 2010. How do you slice the dataframe `wcup` to get the part you are interested in?

In [30]:
# Slice the dataframe using .iloc[ ]

#### .loc
While `.iloc` is integer-based, `.loc` is label-based. It means that you have to access rows and columns based on their row and column labels.

The syntax of `.loc` is `df.loc[row selection, column selection]`.

At the moment, the labels for the rows are just their index numbers. When we use `.loc` to access a row, it will look very similar to what we did with `.iloc`.

In [31]:
# Access a row using .loc
wcup.loc[0]

Year             2022
Champion    Argentina
Host            Qatar
Name: 0, dtype: object

But we could make our index column customized. For example, we could use the column `Year` as the index column.

In [32]:
# Set the column 'Year' as the index column
wcup = wcup.set_index('Year')
wcup

       Champion          Host
Year
2022  Argentina         Qatar
2018     France        Russia
2014    Germany        Brazil
2010      Spain  South Africa
2006      Italy       Germany
2002     Brazil   Korea/Japan
1998     France        France
1994     Brazil           USA
1990    Germany         Italy
1986  Argentina        Mexico

After we make the change, we will use the new labels to access the rows.

In [33]:
# Access a row using .loc
wcup.loc[2006]

Champion      Italy
Host        Germany
Name: 2006, dtype: object

In [34]:
# Access multiple consecutive rows
wcup.loc[2018:2010]

     Champion          Host
Year
2018   France        Russia
2014  Germany        Brazil
2010    Spain  South Africa

Note that with the label search, the ending index row is included.

In [35]:
# Access multiple non-consecutive rows
wcup.loc[[1994, 2002, 2010]]

     Champion          Host
Year
1994   Brazil           USA
2002   Brazil   Korea/Japan
2010    Spain  South Africa

In [36]:
# Access a column
wcup.loc[:, 'Host']

Year
2022           Qatar
2018          Russia
2014          Brazil
2010    South Africa
2006         Germany
2002     Korea/Japan
1998          France
1994             USA
1990           Italy
1986          Mexico
Name: Host, dtype: object

Now that you know how to select rows and columns from a dataframe using `.loc[ ]`. You should be able to figure out how to get a slice of a dataframe using `.loc[ ]`. For example, if you would like to know the champion of the world cup games between 1994 and 2010. How do you slice the dataframe `wcup` to get the part you are interested in?

In [37]:
# Slice the dataframe using .loc[ ]

**As a quick reminder**, remember that `.iloc[]` slicing is not inclusive of the final value. On the other hand, `.loc[]` slicing does include the final value.

In [38]:
# Reset index to revert the dataframe to how it looks like originally
wcup = wcup.reset_index()

<h3 style="color:red; display:inline">Coding Challenge! &lt; / &gt; </h3>
 
You have three students who had failed their math test last time. You would like to select their data from the dataframe you created to see how they did this time. 

You can choose either `.iloc[ ]` or `.loc[ ]` to do this exercise.

## Add new data
### Add new rows
We can add new rows to an existing dataframe.

Suppose we want to add two more world cup games to our dataframe. We will need to use the `.concat()` method to do it.

In [39]:
# We first make a dataframe using the new data
new_data = pd.DataFrame({'Year': [1982, 1978],
                         'Champion': ['Italy', 'Argentina'],
                         'Host': ['Spain', 'Argentina']})

In [40]:
# Concatenate two dataframes 
pd.concat([wcup, new_data])

   Year   Champion          Host
0  2022  Argentina         Qatar
1  2018     France        Russia
2  2014    Germany        Brazil
3  2010      Spain  South Africa
4  2006      Italy       Germany
5  2002     Brazil   Korea/Japan
6  1998     France        France
7  1994     Brazil           USA
8  1990    Germany         Italy
9  1986  Argentina        Mexico
0  1982      Italy         Spain
1  1978  Argentina     Argentina

We can see that Pandas keeps the original index values from the two different input dataframes. There is a parameter `ignore_index` which specifies whether the original indexes are kept or not after concatenation. By default, the `ignore_index` parameter is set to `False`. It means that the original index values from the two different input dataframes will be kept. This can cause duplicate index values in the concatenated dataframe. If you want to ignore the original index values of the dataframes that are concatenated, set the `ignore_index` parameter to `True`.

In [41]:
# Set ignore_index=True, Update the dataframe after the concatenation
wcup = pd.concat([wcup, new_data], ignore_index=True)
wcup

    Year   Champion          Host
0   2022  Argentina         Qatar
1   2018     France        Russia
2   2014    Germany        Brazil
3   2010      Spain  South Africa
4   2006      Italy       Germany
5   2002     Brazil   Korea/Japan
6   1998     France        France
7   1994     Brazil           USA
8   1990    Germany         Italy
9   1986  Argentina        Mexico
10  1982      Italy         Spain
11  1978  Argentina     Argentina

#### Add new columns

The `.concat()` method has an `axis` parameter with which you can specify whether you want to add new data as new rows or new columns. By default, it is set to `0` which stands for `row`. If we set it to `1`, we will add the new data as a new column.

In [42]:
# Add a new column to a dataframe using `.concat()`
pd.concat([wcup, pd.DataFrame({'Filler':range(1, 25, 2)})],axis=1)

    Year   Champion          Host  Filler
0   2022  Argentina         Qatar       1
1   2018     France        Russia       3
2   2014    Germany        Brazil       5
3   2010      Spain  South Africa       7
4   2006      Italy       Germany       9
5   2002     Brazil   Korea/Japan      11
6   1998     France        France      13
7   1994     Brazil           USA      15
8   1990    Germany         Italy      17
9   1986  Argentina        Mexico      19
10  1982      Italy         Spain      21
11  1978  Argentina     Argentina      23

There is a more convenient way of adding a column to a dataframe without using the `.concat()` method.

Recall that when we make a dataframe, we pass a **dictionary** to the `.DataFrame()` method of Pandas. Each `key:value` pair is a column of the table: the key is the header and the value is the list of data under that header. To make a new column, we first put the new data we want to add in a list. Then, we could add the new column in the same way that we add a new `key:value` pair to a dictionary.

In [43]:
# Add a new column of score
score = ["7-5", ### put the data in a list
         "4-2", 
         "1-0", 
         "1-0", 
         "6-4", 
         "2-0", 
         "3-0", 
         "3-2", 
         "1-0", 
         "3-2", 
         "3-1",
         "3-1"]


wcup['Score'] = score # make a new column of score
wcup

    Year   Champion          Host Score
0   2022  Argentina         Qatar   7-5
1   2018     France        Russia   4-2
2   2014    Germany        Brazil   1-0
3   2010      Spain  South Africa   1-0
4   2006      Italy       Germany   6-4
5   2002     Brazil   Korea/Japan   2-0
6   1998     France        France   3-0
7   1994     Brazil           USA   3-2
8   1990    Germany         Italy   1-0
9   1986  Argentina        Mexico   3-2
10  1982      Italy         Spain   3-1
11  1978  Argentina     Argentina   3-1

#### Make a new column based on an old one

The qualification for World Cup starts three years before the year of the game. Let's add a new column to the dataframe storing the qualification start year for the world cups.

In [44]:
# Apply minus operation to a column of integers
wcup['Qualification Start Year'] = wcup['Year'] - 3

Note that we apply the subtraction operation directly to a column of the dataframe without the need to write a for loop to apply the operation to each value in the column. This is made possible by a nice feature of Pandas built on Numpy arrays, which is called broadcasting. This feature allows us to apply an operation to all values in a Series or a Dataframe in a much faster way than writing a for-loop. Let's compare the two.

In [45]:
### Use a for loop to change the values in the Series
import numpy as np

# Make a Pandas Series with 10000 random numbers between 1 and 1000
s = pd.Series(np.random.randint(1,1000, 10000))

# Calculate the time needed to change the values in the series
import time
start = time.process_time()
for ind, val in s.items():
    s.loc[ind] = val + 2
end = time.process_time()
print(end-start)
s

0.15758899999999998

0       164
1       823
2       806
3       921
4       842
       ...
9995    292
9996    587
9997    121
9998    550
9999    131
Length: 10000, dtype: int64

In [46]:
# Use a broadcasting operation to change the values in the Series
s = pd.Series(np.random.randint(1,1000, 10000))

# Calculate the time needed to change the values in the series
start = time.process_time()
s = s + 2
end = time.process_time()
print(end-start)
s

0.0010170000000000456

0       166
1       736
2       305
3       661
4       314
       ...
9995    533
9996    944
9997    759
9998    825
9999    450
Length: 10000, dtype: int64

You can see that leveraging the broadcasting feature of Pandas can complete the same task in a much faster way. When you work with a dataframe, if you want to write a for loop, take a pause and think whether you are using the best possible way to do the task at hand.

<h3 style="color:red; display:inline">Coding Challenge! &lt; / &gt; </h3>
 
You find that the whole Butterfly class did not do well in the English test. You decide to give each student a grade boost of 10%. Create a new column to store the new English scores after the boost.

#### The `.apply()` method

It is often the case that we would want to extract some information from an existing column and put it in a new column. 

Suppose we want to make a new column storing the number of goals the winner scored at the final. The `Score` column actually already has this information available to us. How do we extract the number of goals from the `Score` column and put it in a new column? We can use the `.apply()` method.

In [47]:
# Use the .apply method to operate on an old column and store the results in a new column
wcup['Goals Scored'] = wcup['Score'].apply(lambda r: r.split('-')[0])
wcup

    Year   Champion          Host Score  Qualification Start Year Goals Scored
0   2022  Argentina         Qatar   7-5                      2019            7
1   2018     France        Russia   4-2                      2015            4
2   2014    Germany        Brazil   1-0                      2011            1
3   2010      Spain  South Africa   1-0                      2007            1
4   2006      Italy       Germany   6-4                      2003            6
5   2002     Brazil   Korea/Japan   2-0                      1999            2
6   1998     France        France   3-0                      1995            3
7   1994     Brazil           USA   3-2                      1991            3
8   1990    Germany         Italy   1-0                      1987            1
9   1986  Argentina        Mexico   3-2                      1983            3
10  1982      Italy         Spain   3-1                      1979            3
11  1978  Argentina     Argentina   3-1                      1975            3

What the `.apply()` method does here is it applies the function within the parentheses to the data in each row of the target column. In our example, the target column is the `Score` column. 

As for the function within the parentheses, it looks different from the familiar way of writing a function in Python. Here, what's before the colon stands for the input to the function. What's after the colon is the output of the function. In the current example, the function takes an input string r, splits r by the hyphen `-` into a list of strings and grabs the first element from the list.

In [48]:
# A quick refresh of .split()
"2-1".split('-')

['2', '1']

In [49]:
# Grab the first element of a list
"2-1".split('-')[0]

'2'

Let's also create a new column storing the goals conceded by the champion at the final.

In [50]:
# Use the .apply method to operate on an old column and store the results in a new column
wcup['Goals Conceded'] = wcup['Score'].apply(lambda r: r.split('-')[1])
wcup

,Year,Champion,Host,Score,Qualification Start Year,Goals Scored,Goals Conceded
0,2022,Argentina,Qatar,7-5,2019,7,5
1,2018,France,Russia,4-2,2015,4,2
2,2014,Germany,Brazil,1-0,2011,1,0
3,2010,Spain,South Africa,1-0,2007,1,0
4,2006,Italy,Germany,6-4,2003,6,4
5,2002,Brazil,Korea/Japan,2-0,1999,2,0
6,1998,France,France,3-0,1995,3,0
7,1994,Brazil,USA,3-2,1991,3,2
8,1990,Germany,Italy,1-0,1987,1,0
9,1986,Argentina,Mexico,3-2,1983,3,2
10,1982,Italy,Spain,3-1,1979,3,1
11,1978,Argentina,Argentina,3-1,1975,3,1

You are ready to make still another column storing the difference between the scored goals and conceded goals.

In [51]:
# Make a new column based on two old ones
wcup['Difference'] = wcup['Goals Scored'] - wcup['Goals Conceded']

TypeError: unsupported operand type(s) for -: 'str' and 'str'

We get an error message. Why? Recall that when we create the column 'Score', we store the data as strings. As a result, all the numbers in the column 'Goals Scored' and the column 'Goals Conceded' are also strings. The subtraction operation, however, cannot apply to strings. In order to calculate the difference, we will need to convert the data to numeric types first. In Pandas, we have a method `.astype()` which can easily do that.

In [52]:
# Change the data type to integer and calculate the difference
wcup['Difference'] = wcup['Goals Scored'].astype(int) - wcup['Goals Conceded'].astype(int)
wcup

,Year,Champion,Host,Score,Qualification Start Year,Goals Scored,Goals Conceded,Difference
0,2022,Argentina,Qatar,7-5,2019,7,5,2
1,2018,France,Russia,4-2,2015,4,2,2
2,2014,Germany,Brazil,1-0,2011,1,0,1
3,2010,Spain,South Africa,1-0,2007,1,0,1
4,2006,Italy,Germany,6-4,2003,6,4,2
5,2002,Brazil,Korea/Japan,2-0,1999,2,0,2
6,1998,France,France,3-0,1995,3,0,3
7,1994,Brazil,USA,3-2,1991,3,2,1
8,1990,Germany,Italy,1-0,1987,1,0,1
9,1986,Argentina,Mexico,3-2,1983,3,2,1
10,1982,Italy,Spain,3-1,1979,3,1,2
11,1978,Argentina,Argentina,3-1,1975,3,1,2

<h3 style="color:red; display:inline">Coding Challenge! &lt; / &gt; </h3>
 
Add the student grades from the Hippo Class to your dataframe. You will need to use the `.concat` method.

Add two new columns to your dataframe, one storing the first names of the students, one storing the last names. You will need to use the `.apply()` method.

## Create a dataframe from files of different formats

If you have a file at hand and want to load the data in it in a dataframe, Pandas has methods to do that. 

We can create a dataframe from a .csv file. To do so, we will need to use the `read_csv()` method.

In [53]:
### Download the .csv file
from pathlib import Path
import urllib.request

# Check if a data folder exists. If not, create it.
data_folder = Path('./data/')
data_folder.mkdir(exist_ok=True)

# Download the file
url = 'https://ithaka-labs.s3.amazonaws.com/static-files/images/tdm/tdmdocs/Pandas1_failed_banks_since_2000.csv'
path = './data/' + url.rsplit('/', 1)[-1]
urllib.request.urlretrieve(url, path)

# Success message
print('Sample file ready.')

Sample file ready.

In [54]:
# Use the read_csv() method to create a dataframe
failed_banks = pd.read_csv(path)
failed_banks

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Signature Bank,New York,NY,57053,"Signature Bridge Bank, N.A.",12-Mar-23,10540
1,Silicon Valley Bank,Santa Clara,CA,24735,"Silicon Valley Bridge Bank, N.A.",10-Mar-23,10539
2,Almena State Bank,Almena,KS,15426,Equity Bank,23-Oct-20,10538
3,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb",16-Oct-20,10537
4,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.",3-Apr-20,10536
...,...,...,...,...,...,...,...
560,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
561,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
562,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
563,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
564,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

We can read a Microsoft Excel file into a dataframe by using the `.read_excel()` method. To use this method, we need to install the `openpyxl` library.

In [55]:
# install openpyxl
!pip install openpyxl

Requirement already satisfied: openpyxl in /Users/zchen/opt/anaconda3/lib/python3.9/site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in /Users/zchen/opt/anaconda3/lib/python3.9/site-packages (from openpyxl) (1.1.0)

Suppose you would like to download an `.xsxl` file from Mass.gov containing the data of COVID-19 cases in Massachusetts. You get the url link to the file. You can then use the `.read_excel()` method to read in the data.

In [56]:
# Download the excel file
url = 'https://www.mass.gov/doc/covid-19-raw-data-march-9-2023/download'
path = './data/covid_MA.xsxl'
urllib.request.urlretrieve(url, path)
print('Sample file ready.')

# Read in all sheets from the excel file
covid_ma = pd.read_excel(path, sheet_name=None) # sheet_name=None tells Pandas to read in all sheets

Sample file ready.

The `.read_excel()` method with the `sheet_name` parameter set to `None` will read in all sheets from the excel file. It returns a dictionary whose keys are the sheet names and whose values are the dataframes created from the sheets.

In [57]:
# Get the dataframe associated with a certain sheet name
positive_case = covid_ma['Cases (Report Date)']
positive_case

,Date,Positive Total,Positive New,Probable Total,Probable New,Estimated active cases
0,2020-06-01,97291,326,NaN,NaN,NaN
1,2020-06-02,97539,248,NaN,NaN,NaN
2,2020-06-03,97964,425,NaN,NaN,NaN
3,2020-06-04,98376,412,NaN,NaN,NaN
4,2020-06-05,98796,420,NaN,NaN,NaN
...,...,...,...,...,...,...
675,2023-02-09,2010024,4591,196288.0,975.0,NaN
676,2023-02-16,2014494,4470,197296.0,1008.0,NaN
677,2023-02-23,2018344,3850,198526.0,1230.0,NaN
678,2023-03-02,2021700,3356,199262.0,736.0,NaN
679,2023-03-09,2024403,2703,199934.0,672.0,NaN

Pandas can read in data from files of other formats and create a dataframe out of it. We'll leave it to you to explore!

___
## Lesson Complete

Congratulations! You have completed *Pandas 1*.

### Start Next Lesson: [Pandas 2 ->](./pandas-2.ipynb)

### Exercise Solutions
Here are a few solutions for exercises in this lesson.

In [58]:
# Make a dataframe to record English and Math score of the Butterfly class
butterfly = pd.DataFrame({"Name": ['John Smith', 
                              'Alex Hazel', 
                              'Beatrice Dean', 
                              'Jane White', 
                              'Eve Lynn'],
                          
                         "English": [78,
                                    80,
                                    72,
                                    75,
                                    73],
                          
                         "Math": [80,
                                 75,
                                 95,
                                 70,
                                 82]
                         })
butterfly

            Name  English  Math
0     John Smith       78    80
1     Alex Hazel       80    75
2  Beatrice Dean       72    95
3     Jane White       75    70
4       Eve Lynn       73    82

In [59]:
# Get the math grades of the three students who failed math last time
butterfly = butterfly.set_index('Name')
butterfly.loc[['John Smith', 'Alex Hazel', 'Jane White'], 'Math']

Name
John Smith    80
Alex Hazel    75
Jane White    70
Name: Math, dtype: int64

In [60]:
# Create a new column storing the boosted English grades
butterfly['EnglishBoosted'] = butterfly['English']*1.10
butterfly

               English  Math  EnglishBoosted
Name
John Smith          78    80            85.8
Alex Hazel          80    75            88.0
Beatrice Dean       72    95            79.2
Jane White          75    70            82.5
Eve Lynn            73    82            80.3

In [61]:
# Add the student grades from the Hippo class to the Butterfly dataframe
hippo = pd.DataFrame({"Name": ['Joe Smith', 
                              'Alice Charlie', 
                              'Ben Cole', 
                              'Jill Cheung', 
                              'Dave Gale'],
                          
                         "English": [82,
                                    85,
                                    90,
                                    88,
                                    92],
                          
                         "Math": [85,
                                 78,
                                 92,
                                 80,
                                 82]
                         })

hippo = hippo.set_index('Name')
all_students = pd.concat([butterfly, hippo])
all_students

               English  Math  EnglishBoosted
Name
John Smith          78    80            85.8
Alex Hazel          80    75            88.0
Beatrice Dean       72    95            79.2
Jane White          75    70            82.5
Eve Lynn            73    82            80.3
Joe Smith           82    85             NaN
Alice Charlie       85    78             NaN
Ben Cole            90    92             NaN
Jill Cheung         88    80             NaN
Dave Gale           92    82             NaN

In [62]:
# Add two new columns storing first names and last names respectively
all_students = all_students.reset_index()
all_students['First Name'] = all_students['Name'].apply(lambda name: name.split()[0])
all_students['Last Name'] = all_students['Name'].apply(lambda name: name.split()[1])
all_students

            Name  English  Math  EnglishBoosted First Name Last Name
0     John Smith       78    80            85.8       John     Smith
1     Alex Hazel       80    75            88.0       Alex     Hazel
2  Beatrice Dean       72    95            79.2   Beatrice      Dean
3     Jane White       75    70            82.5       Jane     White
4       Eve Lynn       73    82            80.3        Eve      Lynn
5      Joe Smith       82    85             NaN        Joe     Smith
6  Alice Charlie       85    78             NaN      Alice   Charlie
7       Ben Cole       90    92             NaN        Ben      Cole
8    Jill Cheung       88    80             NaN       Jill    Cheung
9      Dave Gale       92    82             NaN       Dave      Gale